#显示、取消行号
set nu
set nonu

#快速移动
数字0或^:移动到这一行字符的最前面
$:移动到这一行字符的最后面

G:移动到文件的最后一行
nG:n为数字，移动到这个档案的第n行
gg:移动到档案的第一行，相当于1G
n<Enter>:n为数字，光标向下移动n行
n<space>:n为数字，光标向下移动n个字符

#复制、剪切、粘贴
yy:复制光标所在的那一行
nyy:复制光标所在的向下n行
dd:剪切光标所在的那一行
ndd:剪切光标所在的向下n行
p(小写):为复制的数据在光标下一行贴上
P(大写):为复制的数据在光标上一行贴上

#撤销、还原
u:复原前一个动作
Ctrl+r:重做上一个动作
:e!	将档案还原到最原始状态

#查找
/word:光标之后查找一个字符串为word的字符串
?word:光标之前查找一个字符串为word的字符串
n:重复前一个搜寻动作
N:反向进行前一个搜寻动作

#删除
x(小写):向后删除一个字符
X(大写):向前删除一个字符
nx:向后删除n个字符
nX:向前删除n个字符
dd:删除光标所在的那一行
ndd:删除光标所在的向下n行
d1G:删除光标所在到第一行的所有数据
dG:删除光标所在到最后一行的所有数据

#替换
:n1,n2s/word1/word2/g	在n1行与n2行之间寻找word1字符串，并将该字符串替换为Word2 g=global
:1,$s/word1/word2/g	从第一行到最后一行,寻找word1字符串，并将该字符串替换为word2
:1,$s/word1/word2/gc	从第一行到最后一行,寻找word1字符串，并将该字符串替换为word2，在取代前显示提示符给使用者确认是否需要取代
:%s/word1/word2/g	全文替换

#保存、另存为
:w	将编辑的数据写入硬盘档案中
:w!	若档案属性为只读时，强制写入该档案

:w filename	将编辑的数据存储成另一个档案
:n1,n2 w filename	将n1到n2的内容储存成filename这个档案

#退出、保存退出
:q	离开vi
:q!	若曾修改过，但又不想储存，使用！为强制离开不储存档案
:wq	储存后离开；若为:wq!则为强制储存后离开
:x	保存并退出

#翻页
Ctrl+b、pageup屏幕向上移动一页
Ctrl+f、pagedown屏幕向下移动一页

:r [filename]	在编辑的数据中，读入另一个档案的数据。亦即将[filename]这个档案内容加到游标所在行的后面

:command	暂时离开vi到指令模式下执行command的显示结果(如:	:cat xxx.txt)

#vim的附加功能
#块选择
v(小写):字符选择，将光标经过的地方反白选择
V(大写):行选择，将光标经过的行反白选择
Ctrl+v:块选择，可以用长方形的方式选择数据
y:复制反白的地方
d:将反白的地方删除掉

#多文件编辑(如:	vim xxx1.txt xxx2.txt xxx3.txt)
:n(小写)	编辑下一个文件
:N(大写)	编辑上一个文件
:files	列出当前vim打开的所有文件

#多窗口功能
:sp filename	打开一个新的窗口，如果加file，表示在新窗口打开一个新文件，否则表示两窗口同时打开一个文件
Ctrl+wj	先按Ctrl不放，再按w后放开两键，再按j则光标移动到下方的窗口
Ctrl+wk	先按Ctrl不放，再按w后放开两键，再按k则光标移动到上方的窗口
Ctrl+wq	保存退出

